test/integration/data.vm.properties/request-5.xml

<?xml version="1.0" encoding="UTF-8"?>
<soapenv:Envelope xmlns:soapenc="http://schemas.xmlsoap.org/soap/encoding/" xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
  <soapenv:Body>
    <RetrievePropertiesEx xmlns="urn:vim25">
      <_this type="PropertyCollector">propertyCollector</_this>
      <specSet>
        <propSet>
          <type>ContainerView</type>
          <all>false</all>
          <pathSet>view</pathSet>
        </propSet>
        <objectSet>
          <obj type="ContainerView">session[c3dbabcc-69fa-f461-d6da-f10f7df9cdb5]52e64965-2828-55f3-3d5d-c6040986b8e7</obj>
          <skip>false</skip>
        </objectSet>
      </specSet>
      <options>
        <maxObjects>1</maxObjects>
      </options>
    </RetrievePropertiesEx>
  </soapenv:Body>
</soapenv:Envelope>
